<a href="https://colab.research.google.com/github/Evianitary18/SQL-Lite/blob/main/03_Test_SQL_Insert_%26_Select_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Data akan terus bertambah seiring waktu. Yang bisa kita lakukan adalah menambah table. Berikut merupakan caranya.

Pernyataan Insert Into digunakan untuk memasukkan record/data baru.

1. Terdapat insert into untuk memasukkan data baru ke kolom tertentu.

In [ ]:
# INSERT INTO nama_tabel (kolom1, kolom2, kolom3, ...) VALUES (nilai1, nilai2, nilai3, ...)

2. Menggunakan Insert into untuk semua tabel

In [ ]:
# INSERT INTO nama_tabel VALUES (nilai1, nilai2, nilai3,...)

SELECT digunakan untuk memunculkan data dari database. Data yang diminta kemudia disimpan dalam tabel hasil yang disebut dengan kumpulan hasil.

Jika ingin memilih data dari kolom tertentu

In [ ]:
# SELECT kolom1, kolom2, ... FROM nama_table

Jika ingin memunculkan semua kolom yang ada pada table gunakan sintaks

In [ ]:
# SELECT * FROM nama_table;

KODE Sebelumnya di 02. test sql. If u see error, u can merge the code before from 01 & 02 test sql from my repository

In [ ]:
# menambahkan isi table
connection1.execute("SELECT INTO EMAIL (Email, First_Name, Last_Name, Score, Username) VALUES ('putri@gmail.com', 'Kirana', 'Laras', 80, 'kirana01')");

In [ ]:
# display isi table EMAIL
pd.read_sql_query("SELECT * from EMAIL", connection1)

In [ ]:
# menambah isi table kolom tertentu - tertentu saja
connection1.execute("INSERT INTO EMAIL(Email, First_Name) VALUES ('ayu@gmail.com', 'Ayu')");

In [ ]:
# display isi table EMAIL
pd.read_sql_query("SELECT * from EMAIL", connection1)

In [ ]:
# Menambahkan nilai yang tidak sesuai jumlah kolom
connection1.execute("INSERT INTO EMAIL (Email, First_Name, Last_Name, Score, Username) \
VALUES ('putra@gmail.com', 'Putra', 'Arka', 80, 'putra01', 'Jakarta Selatan')");

# Diatas error karena jumlah datanya tidak sesuai dengan jumlah kolom.